[Timeout] BlockStatement
routes/index.js:6:48
 var Foobar = require('../helper-functions/FooBar')
 
 /* GET foo bar */
-router.get('/foobar', function(req, res, next) {
-  res.send(Foobar())
-});
+router.get('/foobar', function(req, res, next) {});
 
 module.exports = router;
