[Survived] StringLiteral
app.js:13:9
 
 // view engine setup
 app.set('views', path.join(__dirname, 'views'));
-app.set('view engine', 'jade');
+app.set("", 'jade');
 
 app.use(logger('dev'));

[Survived] StringLiteral
app.js:15:16
 app.set('views', path.join(__dirname, 'views'));
 app.set('view engine', 'jade');
 
-app.use(logger('dev'));
+app.use(logger(""));
 app.use(express.json());
 app.use(express.urlencoded({ extended: false }));

[Survived] BooleanLiteral
app.js:17:40
 
 app.use(logger('dev'));
 app.use(express.json());
-app.use(express.urlencoded({ extended: false }));
+app.use(express.urlencoded({ extended: true }));
 app.use(cookieParser());
 app.use(express.static(path.join(__dirname, 'public')));

[NoCoverage] BlockStatement
app.js:24:34
 app.use('/', indexRouter);
 
 // catch 404 and forward to error handler
-app.use(function(req, res, next) {
-  next(createError(404));
-});
+app.use(function(req, res, next) {});
 
 // error handler

[NoCoverage] BlockStatement
app.js:29:39
 });
 
 // error handler
-app.use(function(err, req, res, next) {
-  // set locals, only providing error in development
-  res.locals.message = err.message;
-  res.locals.error = req.app.get('env') === 'development' ? err : {};
-
-  // render the error page
-  res.status(err.status || 500);
-  res.render('error');
-});
+app.use(function(err, req, res, next) {});
 
 module.exports = app;

[NoCoverage] EqualityOperator
app.js:32:22
 app.use(function(err, req, res, next) {
   // set locals, only providing error in development
   res.locals.message = err.message;
-  res.locals.error = req.app.get('env') === 'development' ? err : {};
+  res.locals.error = req.app.get('env') !== 'development' ? err : {};
 
   // render the error page

[NoCoverage] ConditionalExpression
app.js:32:22
 app.use(function(err, req, res, next) {
   // set locals, only providing error in development
   res.locals.message = err.message;
-  res.locals.error = req.app.get('env') === 'development' ? err : {};
+  res.locals.error = false ? err : {};
 
   // render the error page

[NoCoverage] ConditionalExpression
app.js:35:14
   res.locals.error = req.app.get('env') === 'development' ? err : {};
 
   // render the error page
-  res.status(err.status || 500);
+  res.status(false);
   res.render('error');
 });

[NoCoverage] LogicalOperator
app.js:35:14
   res.locals.error = req.app.get('env') === 'development' ? err : {};
 
   // render the error page
-  res.status(err.status || 500);
+  res.status(err.status && 500);
   res.render('error');
 });
