[Killed] BlockStatement
helper-functions/FooBar.js:2:22
 
-const Foobar = () => {
-
-    return { foo: 'bar' }
-
-}
+const Foobar = () => {}
 
 module.exports = Foobar;
killedBy: Foobar returns { foo: 'bar'}
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"foo": "bar"}
Received: undefined

[Killed] ObjectLiteral
helper-functions/FooBar.js:4:12
 
 const Foobar = () => {
 
-    return { foo: 'bar' }
+    return {}
 
 }
killedBy: Foobar returns { foo: 'bar'}
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "foo": "bar",
- }
