[Timeout] BlockStatement
routes/index.js:6:42
 var Foobar = require('../helper-functions/FooBar')
 
 /* GET foo bar */
-router.get('/', function(req, res, next) {
-  res.send(Foobar())
-});
+router.get('/', function(req, res, next) {});
 
 module.exports = router;
